# SQL Portfolio Project – Retail Store Analysis

This notebook is a SQL portfolio project created to demonstrate my ability to write clear and correct SQL queries for data exploration and analysis.

The analysis is performed on a retail store dataset and focuses on:

- Selecting and filtering data

- Using aggregate functions to summarize information

- Grouping data to answer business-related questions

- Applying sorting and conditions to extract meaningful results

All queries are written with readability and correctness in mind, reflecting how SQL is commonly used for basic to intermediate analysis tasks in real-world environments.

This notebook was created as part of my SQL portfolio for job applications and is intended to showcase foundational SQL skills applied to a practical dataset.

## Creating a database from the CSV file using sqlite

In [1]:
import pandas as pd
import sqlite3
from pathlib import Path
csv_path = Path("retail_sales_dataset.csv")       
db_path = Path("retail_sales.db")

In [2]:
df = pd.read_csv(csv_path)

In [3]:
print('original column:', df.columns.tolist())

original column: ['Transaction ID', 'Date', 'Customer ID', 'Gender', 'Age', 'Product Category', 'Quantity', 'Price per Unit', 'Total Amount']

In [4]:
df.columns = [col.strip().lower().replace(" ", "_") for col in df.columns]

In [5]:
print(f"cleaned columns: {df.columns.tolist()}")

cleaned columns: ['transaction_id', 'date', 'customer_id', 'gender', 'age', 'product_category', 'quantity', 'price_per_unit', 'total_amount']

In [6]:
#connect or create an sqlite database
conn = sqlite3.connect(db_path)

In [7]:
#import dataframe to sql
df.to_sql(name= "retail_sales", con=conn, if_exists = 'replace', index = False)

1000

In [8]:
#check the number of rows and columns imported
row_count = pd.read_sql("SELECT COUNT(*) As cnt FROM retail_sales;", conn)
row_count

    cnt
0  1000

In [9]:
print(f"Rows imported: {int(row_count['cnt'][0])}")

Rows imported: 1000

In [10]:
col_count = pd.read_sql("PRAGMA table_info(retail_sales);", conn)
len(col_count)

9

In [11]:
 pd.read_sql("PRAGMA table_info(retail_sales);", conn)['name']

0      transaction_id
1                date
2         customer_id
3              gender
4                 age
5    product_category
6            quantity
7      price_per_unit
8        total_amount
Name: name, dtype: object

In [12]:
conn.close()

In [13]:
print(f"\nDone! SQLite database created at: {db_path.resolve()}")

Done! SQLite database created at: C:\Users\chinw\Documents\SQL_projects\retail_sales.db

In [14]:
#load extension and connect to sqlite
%load_ext sql

In [15]:
%sql sqlite:///retail_sales.db

'Connected: @retail_sales.db'

In [16]:
%sql SELECT * FROM retail_sales LIMIT 5;

 * sqlite:///retail_sales.db
Done.

[(1, '2023-11-24', 'CUST001', 'Male', 34, 'Beauty', 3, 50, 150),
 (2, '2023-02-27', 'CUST002', 'Female', 26, 'Clothing', 2, 500, 1000),
 (3, '2023-01-13', 'CUST003', 'Male', 50, 'Electronics', 1, 30, 30),
 (4, '2023-05-21', 'CUST004', 'Male', 37, 'Clothing', 1, 500, 500),
 (5, '2023-05-06', 'CUST005', 'Male', 30, 'Beauty', 2, 50, 100)]

In [17]:
#Total revenue

In [18]:
%%sql

SELECT
    SUM(total_amount) AS total_revenue
FROM retail_sales;

 * sqlite:///retail_sales.db
Done.

[(456000,)]

In [19]:
#total number of transactions

In [20]:
%%sql

SELECT
     COUNT(*) AS total_transactions
FROM retail_sales;

 * sqlite:///retail_sales.db
Done.

[(1000,)]

In [21]:
#total quantity sold

In [22]:
%%sql

SELECT
    SUM(quantity) AS total_quantity_sold
FROM retail_sales;

 * sqlite:///retail_sales.db
Done.

[(2514,)]

In [23]:
#Average order value

In [24]:
%%sql

SELECT 
    SUM(total_amount) / COUNT(*) * 1.0 AS average_order_value
FROM retail_sales;

 * sqlite:///retail_sales.db
Done.

[(456.0,)]

In [25]:
#Revenue by product category

In [26]:
%%sql

SELECT product_category, SUM(total_amount) AS revenue
FROM retail_sales
GROUP BY product_category
ORDER BY revenue DESC;

 * sqlite:///retail_sales.db
Done.

[('Electronics', 156905), ('Clothing', 155580), ('Beauty', 143515)]

In [27]:
#Time-based Analysis(Monthly trends)

In [28]:
#monthly revenue

In [29]:
%%sql

SELECT 
    strftime('%Y-%m',date) AS month,
    SUM(total_amount) AS monthly_revenue
FROM retail_sales
GROUP BY month
ORDER BY monthly_revenue;

 * sqlite:///retail_sales.db
Done.

[('2024-01', 1530),
 ('2023-09', 23620),
 ('2023-03', 28990),
 ('2023-04', 33870),
 ('2023-11', 34920),
 ('2023-01', 35450),
 ('2023-07', 35465),
 ('2023-06', 36715),
 ('2023-08', 36960),
 ('2023-02', 44060),
 ('2023-12', 44690),
 ('2023-10', 46580),
 ('2023-05', 53150)]

#transactions_per_month

In [30]:
%%sql

SELECT 
   strftime('%Y-%m', date) as month,
    COUNT(*) as transaction_count
FROM retail_sales
GROUP BY month
ORDER BY month;

 * sqlite:///retail_sales.db
Done.

[('2023-01', 76),
 ('2023-02', 85),
 ('2023-03', 73),
 ('2023-04', 86),
 ('2023-05', 105),
 ('2023-06', 77),
 ('2023-07', 72),
 ('2023-08', 94),
 ('2023-09', 65),
 ('2023-10', 96),
 ('2023-11', 78),
 ('2023-12', 91),
 ('2024-01', 2)]

In [31]:
#Month-over-Month revenue growth(%)

In [32]:
%%sql
WITH monthly_revenue AS (
    SELECT
        strftime('%Y-%m', date) AS month,
        SUM(total_amount) AS revenue
    FROM retail_sales
    GROUP BY month
),
revenue_with_lag AS (
    SELECT
        month,
        revenue,
        LAG(revenue) OVER (ORDER BY month) AS prev_revenue
    FROM monthly_revenue
)
SELECT
    month,
    revenue,
    prev_revenue,
    CASE 
        WHEN prev_revenue IS NULL THEN NULL
        ELSE ROUND( (revenue - prev_revenue) * 100.0 / prev_revenue, 2)
    END AS month_growth_percent
FROM revenue_with_lag
ORDER BY month;

 * sqlite:///retail_sales.db
Done.

[('2023-01', 35450, None, None),
 ('2023-02', 44060, 35450, 24.29),
 ('2023-03', 28990, 44060, -34.2),
 ('2023-04', 33870, 28990, 16.83),
 ('2023-05', 53150, 33870, 56.92),
 ('2023-06', 36715, 53150, -30.92),
 ('2023-07', 35465, 36715, -3.4),
 ('2023-08', 36960, 35465, 4.22),
 ('2023-09', 23620, 36960, -36.09),
 ('2023-10', 46580, 23620, 97.21),
 ('2023-11', 34920, 46580, -25.03),
 ('2023-12', 44690, 34920, 27.98),
 ('2024-01', 1530, 44690, -96.58)]

In [33]:
#customer Analysis

In [34]:
#3.1 Customer lifetime value (total spend per customer)

In [35]:
%%sql
SELECT
    customer_id,
    SUM(total_amount) AS total_spent,
    COUNT(*) AS total_orders
FROM retail_sales
GROUP BY customer_id
ORDER BY total_spent DESC
LIMIT 5;

 * sqlite:///retail_sales.db
Done.

[('CUST970', 2000, 1),
 ('CUST946', 2000, 1),
 ('CUST927', 2000, 1),
 ('CUST875', 2000, 1),
 ('CUST832', 2000, 1)]

In [36]:
#3.2 Top 10 customers by spend

In [37]:
%%sql
SELECT
    customer_id,
    SUM(total_amount) AS total_spent
FROM retail_sales
GROUP BY customer_id
ORDER BY total_spent DESC
LIMIT 5;

 * sqlite:///retail_sales.db
Done.

[('CUST970', 2000),
 ('CUST946', 2000),
 ('CUST927', 2000),
 ('CUST875', 2000),
 ('CUST832', 2000)]

In [38]:
#Revenue by gender

In [39]:
%%sql
SELECT
    gender,
    SUM(total_amount) AS total_revenue,
    COUNT(*) AS total_transactions
FROM retail_sales
GROUP BY gender;

 * sqlite:///retail_sales.db
Done.

[('Female', 232840, 510), ('Male', 223160, 490)]

In [40]:
#3.4 Revenue by age group (segmentation with CASE)

In [41]:
%%sql
SELECT
    CASE
        WHEN age BETWEEN 18 AND 25 THEN '18-25'
        WHEN age BETWEEN 26 AND 35 THEN '26-35'
        WHEN age BETWEEN 36 AND 50 THEN '36-50'
        ELSE '51+'
    END AS age_group,
    SUM(total_amount) AS total_revenue,
    COUNT(*) AS total_transactions
FROM retail_sales
GROUP BY age_group
ORDER BY total_revenue DESC;

 * sqlite:///retail_sales.db
Done.

[('36-50', 139660, 313),
 ('51+', 133310, 313),
 ('26-35', 98480, 205),
 ('18-25', 84550, 169)]

In [42]:
#Product Category Analysis

In [43]:
#4.1 Quantity sold per product category

In [44]:
%%sql
SELECT
    product_category,
    SUM(quantity) AS total_quantity_sold
FROM retail_sales
GROUP BY product_category
ORDER BY total_quantity_sold DESC;

 * sqlite:///retail_sales.db
Done.

[('Clothing', 894), ('Electronics', 849), ('Beauty', 771)]

In [45]:
#4.2 Average order value by product category

In [46]:
%%sql
SELECT
    product_category,
    SUM(total_amount) * 1.0 / COUNT(*) AS avg_order_value
FROM retail_sales
GROUP BY product_category
ORDER BY avg_order_value DESC;

 * sqlite:///retail_sales.db
Done.

[('Beauty', 467.4755700325733),
 ('Electronics', 458.7865497076023),
 ('Clothing', 443.2478632478632)]

In [47]:
#4.3 Rank categories by revenue (window function)

In [48]:
%%sql
SELECT
    product_category,
    SUM(total_amount) AS total_revenue,
    RANK() OVER (ORDER BY SUM(total_amount) DESC) AS revenue_rank
FROM retail_sales
GROUP BY product_category
ORDER BY revenue_rank;

 * sqlite:///retail_sales.db
Done.

[('Electronics', 156905, 1), ('Clothing', 155580, 2), ('Beauty', 143515, 3)]

In [49]:
#5️⃣ Advanced SQL (CTEs, window functions, segmentation)

In [50]:
#5.1 Rank customers by spend within each product category

In [51]:
%%sql
SELECT
    product_category,
    customer_id,
    SUM(total_amount) AS customer_spend,
    RANK() OVER (
        PARTITION BY product_category 
        ORDER BY SUM(total_amount) DESC
    ) AS spend_rank_in_category
FROM retail_sales
GROUP BY product_category, customer_id
ORDER BY product_category, spend_rank_in_category
LIMIT 10;

 * sqlite:///retail_sales.db
Done.

[('Beauty', 'CUST832', 2000, 1),
 ('Beauty', 'CUST808', 2000, 1),
 ('Beauty', 'CUST743', 2000, 1),
 ('Beauty', 'CUST592', 2000, 1),
 ('Beauty', 'CUST577', 2000, 1),
 ('Beauty', 'CUST503', 2000, 1),
 ('Beauty', 'CUST480', 2000, 1),
 ('Beauty', 'CUST447', 2000, 1),
 ('Beauty', 'CUST281', 2000, 1),
 ('Beauty', 'CUST257', 2000, 1)]

In [52]:
#5.2 Top 5 customers per month

In [53]:
%%sql
WITH customer_monthly_spend AS (
    SELECT
        strftime('%Y-%m', date) AS month,
        customer_id,
        SUM(total_amount) AS total_spent
    FROM retail_sales
    GROUP BY month, customer_id
),
ranked_customers AS (
    SELECT
        month,
        customer_id,
        total_spent,
        RANK() OVER (
            PARTITION BY month
            ORDER BY total_spent DESC
        ) AS spend_rank
    FROM customer_monthly_spend
)
SELECT
    month,
    customer_id,
    total_spent
FROM ranked_customers
WHERE spend_rank <= 5
ORDER BY month, total_spent DESC
LIMIT 10;

 * sqlite:///retail_sales.db
Done.

[('2023-01', 'CUST015', 2000),
 ('2023-01', 'CUST420', 2000),
 ('2023-01', 'CUST592', 2000),
 ('2023-01', 'CUST742', 2000),
 ('2023-01', 'CUST743', 2000),
 ('2023-02', 'CUST152', 2000),
 ('2023-02', 'CUST257', 2000),
 ('2023-02', 'CUST269', 2000),
 ('2023-02', 'CUST416', 2000),
 ('2023-02', 'CUST577', 2000)]

In [54]:
# 5.3 Segment customers into High / Medium / Low value

In [55]:
%%sql
WITH customer_spend AS (
    SELECT
        customer_id,
        SUM(total_amount) AS total_spent
    FROM retail_sales
    GROUP BY customer_id
)
SELECT
    customer_id,
    total_spent,
    CASE
        WHEN total_spent >= 2000 THEN 'High value'
        WHEN total_spent BETWEEN 1000 AND 1999 THEN 'Medium value'
        ELSE 'Low value'
    END AS customer_segment
FROM customer_spend
ORDER BY total_spent ASC
LIMIT 10;

 * sqlite:///retail_sales.db
Done.

[('CUST044', 25, 'Low value'),
 ('CUST103', 25, 'Low value'),
 ('CUST185', 25, 'Low value'),
 ('CUST191', 25, 'Low value'),
 ('CUST201', 25, 'Low value'),
 ('CUST204', 25, 'Low value'),
 ('CUST205', 25, 'Low value'),
 ('CUST206', 25, 'Low value'),
 ('CUST223', 25, 'Low value'),
 ('CUST230', 25, 'Low value')]

In [56]:
#5.4 7-day rolling revenue

In [57]:
%%sql
WITH daily_revenue AS (
    SELECT
        date,
        SUM(total_amount) AS daily_revenue
    FROM retail_sales
    GROUP BY date
)
SELECT
    date,
    daily_revenue,
    SUM(daily_revenue) OVER (
        ORDER BY date
        ROWS BETWEEN 6 PRECEDING AND CURRENT ROW
    ) AS rolling_7_day_revenue
FROM daily_revenue
ORDER BY date;

 * sqlite:///retail_sales.db
Done.

[('2023-01-01', 3600, 3600),
 ('2023-01-02', 1765, 5365),
 ('2023-01-03', 600, 5965),
 ('2023-01-04', 1240, 7205),
 ('2023-01-05', 1100, 8305),
 ('2023-01-06', 620, 8925),
 ('2023-01-07', 150, 9075),
 ('2023-01-08', 625, 6100),
 ('2023-01-09', 200, 4535),
 ('2023-01-10', 230, 4165),
 ('2023-01-11', 280, 3205),
 ('2023-01-13', 1930, 4035),
 ('2023-01-14', 1550, 4965),
 ('2023-01-15', 660, 5475),
 ('2023-01-16', 4000, 8850),
 ('2023-01-17', 1645, 10295),
 ('2023-01-19', 30, 10095),
 ('2023-01-20', 125, 9940),
 ('2023-01-21', 2090, 10100),
 ('2023-01-22', 325, 8875),
 ('2023-01-23', 3120, 11335),
 ('2023-01-24', 2250, 9585),
 ('2023-01-25', 50, 7990),
 ('2023-01-26', 2570, 10530),
 ('2023-01-27', 235, 10640),
 ('2023-01-28', 1020, 9570),
 ('2023-01-29', 600, 9845),
 ('2023-01-30', 740, 7465),
 ('2023-01-31', 2100, 7315),
 ('2023-02-01', 4700, 11965),
 ('2023-02-02', 1375, 10770),
 ('2023-02-03', 1230, 11765),
 ('2023-02-04', 1120, 11865),
 ('2023-02-05', 1805, 13070),
 ('2023-02-06', 625, 12955),
 ('2023-02-07', 2100, 12955),
 ('2023-02-08', 425, 8680),
 ('2023-02-09', 600, 7905),
 ('2023-02-10', 1900, 8575),
 ('2023-02-11', 2215, 9670),
 ('2023-02-12', 500, 8365),
 ('2023-02-13', 3600, 11340),
 ('2023-02-14', 400, 9640),
 ('2023-02-16', 900, 10115),
 ('2023-02-17', 5890, 15405),
 ('2023-02-18', 1000, 14505),
 ('2023-02-19', 2025, 14315),
 ('2023-02-20', 1130, 14945),
 ('2023-02-21', 385, 11730),
 ('2023-02-22', 300, 11630),
 ('2023-02-23', 30, 10760),
 ('2023-02-24', 3200, 8070),
 ('2023-02-25', 2550, 9620),
 ('2023-02-26', 50, 7645),
 ('2023-02-27', 1825, 8340),
 ('2023-02-28', 2180, 10135),
 ('2023-03-01', 460, 10295),
 ('2023-03-02', 300, 10565),
 ('2023-03-03', 970, 8335),
 ('2023-03-04', 1000, 6785),
 ('2023-03-05', 420, 7155),
 ('2023-03-06', 625, 5955),
 ('2023-03-07', 3040, 6815),
 ('2023-03-08', 25, 6380),
 ('2023-03-09', 1200, 7280),
 ('2023-03-10', 175, 6485),
 ('2023-03-11', 500, 5985),
 ('2023-03-12', 525, 6090),
 ('2023-03-13', 300, 5765),
 ('2023-03-15', 1000, 3725),
 ('2023-03-17', 1075, 4775),
 ('2023-03-18', 1620, 5195),
 ('2023-03-19', 80, 5100),
 ('2023-03-20', 2950, 7550),
 ('2023-03-21', 3500, 10525),
 ('2023-03-22', 1390, 11615),
 ('2023-03-23', 1950, 12565),
 ('2023-03-24', 250, 11740),
 ('2023-03-25', 1625, 11745),
 ('2023-03-26', 1420, 13085),
 ('2023-03-27', 590, 10725),
 ('2023-03-28', 100, 7325),
 ('2023-03-29', 500, 6435),
 ('2023-03-30', 200, 4685),
 ('2023-03-31', 1200, 5635),
 ('2023-04-01', 4400, 8410),
 ('2023-04-02', 2600, 9590),
 ('2023-04-04', 1620, 10620),
 ('2023-04-05', 2100, 12620),
 ('2023-04-06', 1200, 13320),
 ('2023-04-08', 2450, 15570),
 ('2023-04-09', 2235, 16605),
 ('2023-04-10', 60, 12265),
 ('2023-04-11', 50, 9715),
 ('2023-04-12', 1590, 9685),
 ('2023-04-13', 360, 7945),
 ('2023-04-15', 700, 7445),
 ('2023-04-16', 300, 5295),
 ('2023-04-17', 25, 3085),
 ('2023-04-18', 500, 3525),
 ('2023-04-19', 2725, 6200),
 ('2023-04-20', 3375, 7985),
 ('2023-04-21', 170, 7795),
 ('2023-04-22', 225, 7320),
 ('2023-04-23', 2905, 9925),
 ('2023-04-24', 170, 10070),
 ('2023-04-25', 160, 9730),
 ('2023-04-26', 270, 7275),
 ('2023-04-27', 1430, 5330),
 ('2023-04-28', 135, 5295),
 ('2023-04-29', 1960, 7030),
 ('2023-04-30', 155, 4280),
 ('2023-05-01', 625, 4735),
 ('2023-05-02', 165, 4740),
 ('2023-05-03', 300, 4770),
 ('2023-05-04', 1140, 4480),
 ('2023-05-05', 1520, 5865),
 ('2023-05-06', 990, 4895),
 ('2023-05-07', 995, 5735),
 ('2023-05-08', 4200, 9310),
 ('2023-05-09', 660, 9805),
 ('2023-05-10', 2200, 11705),
 ('2023-05-11', 30, 10595),
 ('2023-05-12', 100, 9175),
 ('2023-05-13', 800, 8985),
 ('2023-05-14', 1060, 9050),
 ('2023-05-15', 1680, 6530),
 ('2023-05-16', 7260, 13130),
 ('2023-05-17', 3050, 13980),
 ('2023-05-18', 550, 14500),
 ('2023-05-19', 1350, 15750),
 ('2023-05-20', 725, 15675),
 ('2023-05-21', 2900, 17515),
 ('2023-05-22', 1810, 17645),
 ('2023-05-23', 8455, 18840),
 ('2023-05-24', 50, 15840),
 ('2023-05-25', 2600, 17890),
 ('2023-05-26', 2020, 18560),
 ('2023-05-27', 2200, 20035),
 ('2023-05-28', 75, 17210),
 ('2023-05-29', 1200, 16600),
 ('2023-05-30', 140, 8285),
 ('2023-05-31', 2300, 10535),
 ('2023-06-01', 160, 8095),
 ('2023-06-02', 150, 6225),
 ('2023-06-03', 1025, 5050),
 ('2023-06-04', 1030, 6005),
 ('2023-06-05', 100, 4905),
 ('2023-06-06', 1950, 6715),
 ('2023-06-07', 150, 4565),
 ('2023-06-08', 1700, 6105),
 ('2023-06-09', 1820, 7775),
 ('2023-06-10', 2750, 9500),
 ('2023-06-11', 3300, 11770),
 ('2023-06-12', 50, 11720),
 ('2023-06-13', 500, 10270),
 ('2023-06-14', 900, 11020),
 ('2023-06-15', 220, 9540),
 ('2023-06-16', 230, 7950),
 ('2023-06-17', 1450, 6650),
 ('2023-06-18', 900, 4250),
 ('2023-06-19', 2945, 7145),
 ('2023-06-20', 190, 6835),
 ('2023-06-21', 175, 6110),
 ('2023-06-22', 1220, 7110),
 ('2023-06-23', 170, 7050),
 ('2023-06-24', 6220, 11820),
 ('2023-06-25', 900, 11820),
 ('2023-06-26', 2130, 11005),
 ('2023-06-27', 900, 11715),
 ('2023-06-28', 300, 11840),
 ('2023-06-29', 2150, 12770),
 ('2023-06-30', 1030, 13630),
 ('2023-07-01', 1750, 9160),
 ('2023-07-03', 230, 8490),
 ('2023-07-04', 500, 6860),
 ('2023-07-05', 780, 6740),
 ('2023-07-06', 2260, 8700),
 ('2023-07-08', 220, 6770),
 ('2023-07-09', 325, 6065),
 ('2023-07-11', 200, 4515),
 ('2023-07-12', 30, 4315),
 ('2023-07-13', 100, 3915),
 ('2023-07-14', 5125, 8260),
 ('2023-07-15', 3000, 9000),
 ('2023-07-16', 190, 8970),
 ('2023-07-17', 950, 9595),
 ('2023-07-19', 2060, 11455),
 ('2023-07-21', 1000, 12425),
 ('2023-07-22', 150, 12475),
 ('2023-07-23', 2000, 9350),
 ('2023-07-24', 4610, 10960),
 ('2023-07-25', 2000, 12770),
 ('2023-07-26', 1000, 12820),
 ('2023-07-27', 1190, 11950),
 ('2023-07-28', 3450, 14400),
 ('2023-07-29', 575, 14825),
 ('2023-07-30', 270, 13095),
 ('2023-07-31', 1500, 9985),
 ('2023-08-01', 720, 8705),
 ('2023-08-02', 50, 7755),
 ('2023-08-03', 375, 6940),
 ('2023-08-04', 260, 3750),
 ('2023-08-05', 5205, 8380),
 ('2023-08-06', 2500, 10610),
 ('2023-08-07', 1020, 10130),
 ('2023-08-08', 1385, 10795),
 ('2023-08-09', 1010, 11755),
 ('2023-08-10', 200, 11580),
 ('2023-08-11', 900, 12220),
 ('2023-08-12', 1370, 8385),
 ('2023-08-13', 700, 6585),
 ('2023-08-14', 1230, 6795),
 ('2023-08-15', 970, 6380),
 ('2023-08-17', 900, 6270),
 ('2023-08-18', 1630, 7700),
 ('2023-08-19', 2160, 8960),
 ('2023-08-20', 90, 7680),
 ('2023-08-21', 1560, 8540),
 ('2023-08-22', 1275, 8585),
 ('2023-08-23', 1730, 9345),
 ('2023-08-24', 1305, 9750),
 ('2023-08-25', 395, 8515),
 ('2023-08-26', 955, 7310),
 ('2023-08-27', 1725, 8945),
 ('2023-08-28', 350, 7735),
 ('2023-08-29', 2630, 9090),
 ('2023-08-31', 2360, 9720),
 ('2023-09-01', 1375, 9790),
 ('2023-09-02', 1370, 10765),
 ('2023-09-03', 300, 10110),
 ('2023-09-04', 1000, 9385),
 ('2023-09-05', 530, 9565),
 ('2023-09-06', 1765, 8700),
 ('2023-09-07', 420, 6760),
 ('2023-09-08', 1125, 6510),
 ('2023-09-09', 200, 5340),
 ('2023-09-10', 200, 5240),
 ('2023-09-11', 2200, 6440),
 ('2023-09-13', 50, 5960),
 ('2023-09-14', 1200, 5395),
 ('2023-09-15', 75, 5050),
 ('2023-09-16', 2150, 6075),
 ('2023-09-17', 700, 6575),
 ('2023-09-18', 1000, 7375),
 ('2023-09-19', 160, 5335),
 ('2023-09-21', 105, 5390),
 ('2023-09-22', 140, 4330),
 ('2023-09-23', 100, 4355),
 ('2023-09-24', 390, 2595),
 ('2023-09-25', 1090, 2985),
 ('2023-09-26', 100, 2085),
 ('2023-09-28', 425, 2350),
 ('2023-09-29', 2550, 4795),
 ('2023-09-30', 2900, 7555),
 ('2023-10-01', 2800, 10255),
 ('2023-10-02', 1245, 11110),
 ('2023-10-03', 2170, 12190),
 ('2023-10-04', 3010, 15100),
 ('2023-10-05', 530, 15205),
 ('2023-10-06', 1500, 14155),
 ('2023-10-07', 2500, 13755),
 ('2023-10-08', 2025, 12980),
 ('2023-10-09', 195, 11930),
 ('2023-10-10', 2120, 11880),
 ('2023-10-11', 2250, 11120),
 ('2023-10-12', 475, 11065),
 ('2023-10-13', 1175, 10740),
 ('2023-10-14', 110, 8350),
 ('2023-10-15', 1500, 7825),
 ('2023-10-16', 2860, 10490),
 ('2023-10-17', 175, 8545),
 ('2023-10-18', 2025, 8320),
 ('2023-10-19', 1860, 9705),
 ('2023-10-20', 50, 8580),
 ('2023-10-21', 50, 8520),
 ('2023-10-22', 1950, 8970),
 ('2023-10-23', 800, 6910),
 ('2023-10-24', 2200, 8935),
 ('2023-10-25', 3500, 10410),
 ('2023-10-26', 740, 9290),
 ('2023-10-27', 3650, 12890),
 ('2023-10-29', 1250, 14090),
 ('2023-10-30', 75, 12215),
 ('2023-10-31', 1790, 13205),
 ('2023-11-01', 1450, 12455),
 ('2023-11-02', 1915, 10870),
 ('2023-11-03', 1200, 11330),
 ('2023-11-04', 500, 8180),
 ('2023-11-05', 1800, 8730),
 ('2023-11-06', 2700, 11355),
 ('2023-11-07', 1560, 11125),
 ('2023-11-08', 210, 9885),
 ('2023-11-09', 3100, 11070),
 ('2023-11-10', 115, 9985),
 ('2023-11-12', 225, 9710),
 ('2023-11-13', 1225, 9135),
 ('2023-11-14', 1080, 7515),
 ('2023-11-15', 1630, 7585),
 ('2023-11-16', 1500, 8875),
 ('2023-11-17', 2610, 8385),
 ('2023-11-18', 1130, 9400),
 ('2023-11-19', 300, 9475),
 ('2023-11-20', 50, 8300),
 ('2023-11-21', 1060, 8280),
 ('2023-11-22', 2200, 8850),
 ('2023-11-23', 1590, 8940),
 ('2023-11-24', 1110, 7440),
 ('2023-11-25', 150, 6460),
 ('2023-11-26', 1600, 7760),
 ('2023-11-27', 235, 7945),
 ('2023-11-28', 390, 7275),
 ('2023-11-29', 1825, 6900),
 ('2023-11-30', 460, 5770),
 ('2023-12-01', 110, 4770),
 ('2023-12-02', 3030, 7650),
 ('2023-12-03', 600, 6650),
 ('2023-12-04', 1730, 8145),
 ('2023-12-05', 2475, 10230),
 ('2023-12-06', 2940, 11345),
 ('2023-12-07', 1400, 12285),
 ('2023-12-08', 2800, 14975),
 ('2023-12-09', 3925, 15870),
 ('2023-12-10', 1420, 16690),
 ('2023-12-11', 950, 15910),
 ('2023-12-12', 200, 13635),
 ('2023-12-13', 725, 11420),
 ('2023-12-14', 660, 10680),
 ('2023-12-15', 2050, 9930),
 ('2023-12-16', 1130, 7135),
 ('2023-12-17', 1500, 7215),
 ('2023-12-18', 2250, 8515),
 ('2023-12-19', 790, 9105),
 ('2023-12-20', 1350, 9730),
 ('2023-12-21', 300, 9370),
 ('2023-12-22', 1000, 8320),
 ('2023-12-23', 1850, 9040),
 ('2023-12-24', 200, 7740),
 ('2023-12-25', 1200, 6690),
 ('2023-12-26', 1880, 7780),
 ('2023-12-27', 700, 7130),
 ('2023-12-28', 2075, 8905),
 ('2023-12-29', 3400, 11305),
 ('2023-12-31', 50, 9505),
 ('2024-01-01', 1530, 10835)]

In [58]:
#6.1 Show table schema

In [59]:
%%sql
PRAGMA table_info(retail_sales);

 * sqlite:///retail_sales.db
Done.

[(0, 'transaction_id', 'INTEGER', 0, None, 0),
 (1, 'date', 'TEXT', 0, None, 0),
 (2, 'customer_id', 'TEXT', 0, None, 0),
 (3, 'gender', 'TEXT', 0, None, 0),
 (4, 'age', 'INTEGER', 0, None, 0),
 (5, 'product_category', 'TEXT', 0, None, 0),
 (6, 'quantity', 'INTEGER', 0, None, 0),
 (7, 'price_per_unit', 'INTEGER', 0, None, 0),
 (8, 'total_amount', 'INTEGER', 0, None, 0)]

In [60]:
#count columns

In [61]:
%%sql
SELECT COUNT(*) AS num_columns
FROM pragma_table_info('retail_sales');

 * sqlite:///retail_sales.db
Done.

[(9,)]